#!/bin/bash

############################################################################################################################
#
# 该脚本暂定为程序的入口，参数从这里输入，做了一些预定义操作之后，将配置输入给capture.py执行
# TODO: 脚本需要完成的工作
# 1. 读入预处理命令，比如cmake的预处理，参数输入，环境配置等
# 2. 创建目录，包括输入目录和make build目录等
# 3. 如果没有输入编译方式，如果扫描目录的结构，找到解析的类型
# 4. 如果如果build目录在项目根目录下，如何排除等
# 5. 根据编译器的选择来生成对应的默认预处理和capture 参数输入等
#
############################################################################################################################


# vi:set tw=0 ts=4 sw=4 nowrap fdm=indent
